fun main() {
    // Объявление переменных с явным указанием типа
    val length: Long = 40_868_600_000L // длина трассы в миллиметрах
    val age: Byte = 27 // возраст Гагарина
    val partOfDay: Float = 0.075f // часть дня в космосе
    val seconds: Short = 6480 // количество секунд в космосе
    val partOfYear: Double = 2.0547945205479453E-4 // часть года в космосе
    val apogee: Int = 327000 // апогей орбиты в метрах

    // Вывод значений переменных
    println("Расстояние, которое пролетел Гагарин пока был в космосе (мм): $length")
    println("Возраст Гагарина на момент полета (лет): $age")
    println("Какую часть дня Гагарин провел в космосе: $partOfDay")
    println("Количество секунд, которое Гагарин провел в космосе: $seconds")
    println("Какую часть года Гагарин провел в космосе: $partOfYear")
    println("Апогей орбиты Гагарина (м): $apogee")
}
